class NewsHandler {
 static List headers = [
    'Apple розглядає можливість виробництва гаджетів в Індонезії',
    'Apple випустить продукти з процесорами M4 та функціями ШІ',
    'Чи дійсно iOS 18 отримає локальний ШІ?',
    'Новинки,які приписують iPhone 16 Pro'
  ];

 static List content = [
    "Компанія Apple розгляне можливість будівництва виробничого підприємства в Індонезії. Про це заявив гендиректор Apple Тім Кук після зустрічі з президентом Індонезії Джоко Відодо, пише Reuters.\n\nВідодо висловив сподівання, що технологічний гігант збільшить присутність в Індонезії за рахунок партнерства з місцевими компаніями. Тім Кук прибув до Джакарти у вівторок після візиту до В'єтнаму. Він зустрівся з президентом країни, і відкрив четверту академію для розробників на острові Балі.",
    "Компанія випустила комп’ютери Mac з чипами M3 лише п’ять місяців тому, але вже наближається до наступного покоління, процесорів M4. Новий чип отримає щонайменше три модифікації. Apple планує випустити оновлені комп’ютери наприкінці цього року та продовжити на початку наступного.\n\nВийдуть нові iMac, недорогий 14” MacBook Pro, високоякісні 14” та 16”і MacBook Pro, а також Mac mini — усі з чипами M4, але плани все ще можуть змінитися. Apple планує продовжити виробництво Mac на M4 протягом 2025 року. Це включає оновлення для 13” та 15” MacBook Air до весни, Mac Studio приблизно в середині року та Mac Pro пізніше 2025 року.",
    "Apple анонсує iOS 18 разом з іншими новими версіями ОС на майбутній презентації WWDC24 10 червня. Вагомою частиною цієї великої презентації стануть перші функції штучного інтелекту, які, за даними Марка Гурмана, працюватимуть локально на пристрої без залучення віддалених серверів.\n\nЦе означає, з великої мовної моделі, яка забезпечуватиме роботу ШІ-сервісів Apple, «вирізали» компонент хмарної обробки даних. Безпечніша локальна обробка чутливої персональної інформації має стати однієї з ключових відмінностей ШІ Apple, яка постійно робить окремий акцент на забезпеченні конфіденційності та безпеки на iPhone та інших продуктах.\n\nЗа попередніми даними, в iOS 18 з’являться нові функції генеративного ШІ для пошукового інструменту Spotlight на iPhone. Також новими функціями ШІ прокачають Siri, Safari, Shortcuts, Apple Music, Messages, Health, Numbers, Pages, Keynote та інші додатки. Раніше Гурман повідомляв, що Siri порозумнішає та навчиться відповідати на складніші питання, а в Messages з’явиться автозавершення речень.",
    "Корейські джерела стверджують, що Apple тестує нову технологію оптичного покриття для майбутніх камер iPhone. Вона допоможе покращити якість фотографій за рахунок зменшення таких артефактів, як відблиски та ореоли.\n\nЗазначається, що Apple розглядає можливість впровадження нового обладнання ALD (atomic layer deposition) у процес виробництва об’єктивів камери iPhone. ALD дозволяє здійснювати нанесення матеріалів на підкладку по одному атомному шару за раз, що дозволяє надзвичайно точно контролювати товщину та склад. Використання такого обладнання дозволяє виробникам наносити дуже тонкі шари матеріалів на напівпровідникові пристрої, включаючи компоненти камер. \n\nУ випадку об’єктивів камер ALD можна використовувати для нанесення антиблікових покриттів, які можуть допомогти зменшити фотографічні артефакти, як-от смуги світла та ореоли. Зазвичай вони можуть утворюватися на кінцевому зображенні, коли яскраве джерело світла, наприклад сонце, світить прямо на об’єктив.",
  ];

 static List images = [
    'https://images.unian.net/photos/2024_04/1713444945-2792.jpg?r=254861',
    'https://itc.ua/wp-content/uploads/2023/11/Apple-MacBook-Pro-2up-231030-scaled.jpg',
    'https://itc.ua/wp-content/uploads/2023/12/Depositphotos_601297296_L.jpg',
    'https://cdsassets.apple.com/live/7WUAS350/images/iphone/fall-2023-iphone-colors-iphone-15-pro.png'
  ];
}
